Revit 2020 API
Hardwood Class
 Represents the properties of materials.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2018.1
Syntax
C#
public static class Hardwood
Visual Basic
Public NotInheritable Class Hardwood
Visual C++
public ref class Hardwood abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.Hardwood
See Also
Hardwood Members
Autodesk.Revit.DB.Visual Namespace